In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [10]:
%%sql
drop table if exists Employee_2;
Create Table Employee_2(
EmpName Varchar(30),
DeptName Varchar(25),
DeptNo Bigint,
Salary Bigint);

 * sqlite:///./test.db
Done.
Done.

[]

In [11]:
%%sql
Insert into Employee_2 Values('Mark','HR',101,30000);
Insert into Employee_2 Values('John','Accountant',101,20000);
Insert into Employee_2 Values('Smith','Analyst',101,25000);
Insert into Employee_2 Values('Donald','HR',201,40000);
Insert into Employee_2 Values('James','Analyst',201,22000);
Insert into Employee_2 Values('Maria','Analyst',201,38000);
Insert into Employee_2 Values('David','Manager',201,33000);
Insert into Employee_2 Values('Martin','Analyst',301,22000);
Insert into Employee_2 Values('Robert','Analyst',301,56000);
Insert into Employee_2 Values('Michael','Manager',301,34000);
Insert into Employee_2 Values('Robert','Accountant',301,37000);
Insert into Employee_2 Values('Michael','Analyst',301,28000);

 * sqlite:///./test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%sql select * from employee_2 limit 5

 * sqlite:///./test.db
Done.

[('Mark', 'HR', 101, 30000),
 ('John', 'Accountant', 101, 20000),
 ('Smith', 'Analyst', 101, 25000),
 ('Donald', 'HR', 201, 40000),
 ('James', 'Analyst', 201, 22000)]

Query to show records for all employees getting max/min salary per department

In [13]:
%%sql
select E1.empname,E1.deptname,E1.deptno,salary from employee_2 E1
left join 
(select deptno,max(salary) maxsal from employee_2 group by deptno) E2 
on E1.deptno=E2.deptno and E1.salary=E2.maxsal
left join
(select deptno,min(salary) minsal from employee_2 group by deptno) E3 
on E1.deptno=E3.deptno and E3.minsal=E1.salary
where not (E2.deptno is null and E3.deptno is null)
order by E1.deptno,E1.Salary

 * sqlite:///./test.db
Done.

[('John', 'Accountant', 101, 20000),
 ('Mark', 'HR', 101, 30000),
 ('James', 'Analyst', 201, 22000),
 ('Donald', 'HR', 201, 40000),
 ('Martin', 'Analyst', 301, 22000),
 ('Robert', 'Analyst', 301, 56000)]

In [14]:
%%sql
select empname,deptname,deptno,salary from
(
select empname,deptname,deptno,salary,
rank() over(partition by deptno order by salary asc) minrank,
rank() over(partition by deptno order by salary desc) maxrank
from employee_2
)X where minrank=1 or maxrank=1
order by deptno,salary

 * sqlite:///./test.db
Done.

[('John', 'Accountant', 101, 20000),
 ('Mark', 'HR', 101, 30000),
 ('James', 'Analyst', 201, 22000),
 ('Donald', 'HR', 201, 40000),
 ('Martin', 'Analyst', 301, 22000),
 ('Robert', 'Analyst', 301, 56000)]